In [4]:
import dask.dataframe as dd

import pandas as pd

## Example #1

In [13]:
df = pd.DataFrame({"col1": ["a", "b", "c", "d"], "col2": [1, 2, 3, 4]})

In [14]:
df

  col1  col2
0    a     1
1    b     2
2    c     3
3    d     4

In [15]:
ddf = dd.from_pandas(df, npartitions=2)

In [16]:
ddf.compute()

  col1  col2
0    a     1
1    b     2
2    c     3
3    d     4

In [17]:
ddf.partitions[0].compute()

  col1  col2
0    a     1
1    b     2

In [18]:
ddf.partitions[1].compute()

  col1  col2
2    c     3
3    d     4

In [10]:
def print_partitions(ddf):
    for i in range(ddf.npartitions):
        print(ddf.partitions[i].compute())

In [11]:
print_partitions(ddf)

  col1  col2
0    a     1
1    b     2
  col1  col2
2    c     3
3    d     4

In [12]:
ddf.known_divisions

True

In [13]:
ddf.divisions

(0, 2, 3)

## Example #2

In [10]:
df = pd.DataFrame(
    {"name": ["li", "sue", "john", "carlos"], "balance": [10, 20, 30, 40]}
)

In [11]:
df

     name  balance
0      li       10
1     sue       20
2    john       30
3  carlos       40